# 4.9.1 Customer Dataset Prep and Merge
## 0.1 Initialization
## 0.2 Data Wrangling
## 0.3 Consistency Checks
## 0.4 Combining Datasets

## 0.1 Initialization

In [2]:
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

In [3]:
path = '/Users/matthewmacbook/Documents/CareerFoundry/Data Immersion/Achievement 4 - Python Fundamentals for Data Analysts/Instacart Basket Analysis 26-07-2023'

In [4]:
cust = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'customers.csv'))

In [5]:
cust.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

## 0.2 Data Wrangling

In [6]:
cust.dtypes

user_id          int64
First Name      object
Surnam          object
Gender          object
STATE           object
Age              int64
date_joined     object
n_dependants     int64
fam_status      object
income           int64
dtype: object

In [7]:
# drop first name and last name columns as they are private information and add nothing to the analysis
cust = cust.drop(columns = ['First Name', 'Surnam'])

In [8]:
cust.value_counts('fam_status')

fam_status
married                             144906
single                               33962
divorced/widowed                     17640
living with parents and siblings      9701
dtype: int64

In [9]:
# rename columns with inconsistent or incomplete names
cust = cust.rename(columns = {'n_dependants' : 'number_dependents', 'fam_status' : 'family_status', 'STATE' : 'State', 'income' :'Income'})

In [10]:
cust.head()

,user_id,Gender,State,Age,date_joined,number_dependents,family_status,Income
0,26711,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Female,Maryland,26,1/1/2017,1,married,40374

## 0.3 Consistency Checks

In [11]:
cust.describe()

             user_id            Age  number_dependents         Income
count  206209.000000  206209.000000      206209.000000  206209.000000
mean   103105.000000      49.501646           1.499823   94632.852548
std     59527.555167      18.480962           1.118433   42473.786988
min         1.000000      18.000000           0.000000   25903.000000
25%     51553.000000      33.000000           0.000000   59874.000000
50%    103105.000000      49.000000           1.000000   93547.000000
75%    154657.000000      66.000000           3.000000  124244.000000
max    206209.000000      81.000000           3.000000  593901.000000

In [12]:
# check for missing/null values
cust.isnull().sum()

user_id              0
Gender               0
State                0
Age                  0
date_joined          0
number_dependents    0
family_status        0
Income               0
dtype: int64

No missing values were found. No changes are needed for the purposes of addressing missing values

In [13]:
# find and show any duplicate values
cust[cust.duplicated()]

Empty DataFrame
Columns: [user_id, Gender, State, Age, date_joined, number_dependents, family_status, Income]
Index: []

No duplicates were found. No changes necessary for the purposes of addressing duplicate values

## 0.4 Combining Datasets

In [14]:
ords_prods_merge = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'orders_products_merged_flagged.pkl'))

In [15]:
ords_prods_merge = ords_prods_merge.drop(columns = ['_merge'])

In [16]:
ords_prods_cust_merge = ords_prods_merge.merge(cust, on = 'user_id', indicator = True)

In [18]:
ords_prods_cust_merge.shape

(32404859, 31)

In [ ]:
ords_prods_cust_merge.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'orders_products_customers.pkl'))